ART-Badge/SDK/bsp_for_art-badge/libraries/inc/peripheral/rtl876x_i2c.h
/**
 * \brief   Get the specified I2C interrupt status.
 * \param[in] I2Cx: where x can be 0 or 1.
 * \param[in] I2C_IT
 *      This parameter can be one of the following values:
 *      \arg I2C_INT_GEN_CALL: Set only when a General Call address is received and it is acknowledged.
 *      \arg I2C_INT_START_DET: Indicates whether a START or RESTART condition has occurred on the I2C
                              interface regardless of whether DW_apb_i2c is operating in slave or master mode.
 *      \arg I2C_INT_STOP_DET:  Indicates whether a STOP condition has occurred on the I2C interface regardless
                              of whether DW_apb_i2c is operating in slave or master mode
 *      \arg I2C_INT_ACTIVITY:  This bit captures DW_apb_i2c activity and stays set until it is cleared.
 *      \arg I2C_INT_RX_DONE:   When the DW_apb_i2c is acting as a slave-transmitter, this bit is set to 1 if the
                              master does not acknowledge a transmitted byte. This occurs on the last byte of
                              the transmission, indicating that the transmission is done.
 *      \arg I2C_INT_TX_ABRT:   This bit indicates if DW_apb_i2c, as an I2C transmitter, is unable to complete the
                              intended actions on the contents of the transmit FIFO.
 *      \arg I2C_INT_RD_REQ:    This bit is set to 1 when acting as a slave and another I2C master
                              is attempting to read data.
 *      \arg I2C_INT_TX_EMPTY:  This bit is set to 1 when the transmit buffer is at or below the threshold value set
                              in the IC_TX_TL register.
 *      \arg I2C_INT_TX_OVER:   Set during transmit if the transmit buffer is filled to IC_TX_BUFFER_DEPTH and
                              the processor attempts to issue another I2C command.
 *      \arg I2C_INT_RX_FULL:   Set when the receive buffer reaches or goes above the RX_TL threshold in the
                              IC_RX_TL register
 *      \arg I2C_INT_RX_OVER:   Set if the receive buffer is completely filled to IC_RX_BUFFER_DEPTH and an
                               additional byte is received from an external I2C device.
 *      \arg I2C_INT_RX_UNDER:   Set if the processor attempts to read the receive buffer when it is empty by reading.
 * \return  The new state of I2C_IT (SET or RESET).
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void i2c0_demo(void)
 * {
 *     ITStatus int_status = I2C_GetINTStatus(I2C0, I2C_INT_RD_REQ);
 * }
 * \endcode
 */
__STATIC_INLINE ITStatus I2C_GetINTStatus(I2C_TypeDef *I2Cx, uint32_t I2C_IT)
{
    ITStatus bit_status = RESET;

    /* Check the parameters */
    assert_param(IS_I2C_ALL_PERIPH(I2Cx));
    assert_param(I2C_GET_INT(I2C_IT));

    if ((I2Cx->IC_INTR_STAT & I2C_IT) != (uint32_t)RESET)
    {
        bit_status = SET;
    }

    /* Return the I2C_IT status */
    return  bit_status;
}

/**
 * \brief   Enable or disable the I2Cx GDMA interface.
 * \param[in] I2Cx: Where x can be 0 or 1
 * \param[in] I2C_GDMAReq: Specifies the I2C GDMA transfer request to be enabled or disabled.
 *      This parameter can be one of the following values:
 *      \arg I2C_GDMAReq_Tx: Tx buffer GDMA transfer request.
 *      \arg I2C_GDMAReq_Rx: Rx buffer GDMA transfer request.
 * \param[in] NewState: New state of the selected I2C GDMA transfer request.
 *      This parameter can be: ENABLE or DISABLE.
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void i2c0_demo(void)
 * {
 *     I2C_GDMACmd(I2C0, I2C_GDMAReq_Tx, ENABLE);
 * }
 * \endcode
 */
__STATIC_INLINE void I2C_GDMACmd(I2C_TypeDef *I2Cx, uint16_t I2C_GDMAReq, FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_I2C_ALL_PERIPH(I2Cx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));
    assert_param(IS_I2C_GDMAREQ(I2C_GDMAReq));

    if (NewState != DISABLE)
    {
        /* Enable the selected I2C GDMA request */
        I2Cx->IC_DMA_CR |= I2C_GDMAReq;
    }
    else
    {
        /* Disable the selected I2C GDMA request */
        I2Cx->IC_DMA_CR &= (uint16_t)~(I2C_GDMAReq);
    }
}

/** \} */ /* End of group I2C_Exported_Functions */

#ifdef __cplusplus
}
#endif

#endif /*_RTL8762X_I2C_H_*/


/******************* (C) COPYRIGHT 2015 Realtek Semiconductor Corporation *****END OF FILE****/

